In [5]:
import pandas as pd
import numpy as np

In [14]:
data = np.random.randint(1.0,100.0,25)

In [15]:
data

array([19, 65, 38, 85, 98, 73, 77, 69, 96, 94, 93, 19, 67, 67, 71, 97, 56,
       31, 73, 47, 25, 85, 63, 10, 64])

In [17]:
s = pd.Series(data)

In [18]:
s

0     19
1     65
2     38
3     85
4     98
5     73
6     77
7     69
8     96
9     94
10    93
11    19
12    67
13    67
14    71
15    97
16    56
17    31
18    73
19    47
20    25
21    85
22    63
23    10
24    64
dtype: int32

In [19]:
l=[1,2,3,np.nan,"helo"]

In [20]:
k=pd.Series(l)

In [21]:
k

0       1
1       2
2       3
3     NaN
4    helo
dtype: object

In [153]:
dates = pd.date_range('20180918',periods=8,freq='D')

In [154]:
dates

DatetimeIndex(['2018-09-18', '2018-09-19', '2018-09-20', '2018-09-21',
               '2018-09-22', '2018-09-23', '2018-09-24', '2018-09-25'],
              dtype='datetime64[ns]', freq='D')

In [27]:
st_name = ['one','two','three',np.nan,'four','five']

In [28]:
st_name = pd.Series(st_name)

In [31]:
st_name
st_name[4]

'four'

In [33]:
print(dir(st_name))

['T', '_AXIS_ALIASES', '_AXIS_IALIASES', '_AXIS_LEN', '_AXIS_NAMES', '_AXIS_NUMBERS', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_SLICEMAP', '__abs__', '__add__', '__and__', '__array__', '__array_prepare__', '__array_priority__', '__array_wrap__', '__bool__', '__bytes__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__div__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__le__', '__len__', '__long__', '__lt__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pow__', '__radd__', '__rand__', '__rdiv__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__unicode__', '__weakref__', '__xor__', '_accessors', '_add_numeric_operations', '_add_series_only_operations', '_add_series_or_dataframe_operations', '_agg_by_level', '_agg_doc', '_aggregate', '_aggregate_multiple_funcs', '_align_frame', '_align_series', '_allow_index_ops', '_at', '_binop', '_box_item_values', '_builtin_table', '_can_hold_na', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_percentile', '_check_setitem_copy', '_clear_item_cache', '_clip_with_scalar', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_dict_for_slice', '_construct_axes_dict_from', '_construct_axes_from_arguments', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_create_indexer', '_cython_table', '_dir_additions', '_dir_deletions', '_expand_axes', '_from_axes', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_index_resolvers', '_get_item_cache', '_get_numeric_data', '_get_values', '_get_values_tuple', '_get_with', '_gotitem', '_iat', '_iget_item_cache', '_iloc', '_index', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_mgr', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_cython_func', '_is_datelike_mixed_type', '_is_mixed_type', '_is_numeric_mixed_type', '_is_view', '_ix', '_ixs', '_loc', '_make_cat_accessor', '_make_dt_accessor', '_make_str_accessor', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_axis', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_is_copy', '_set_item', '_set_labels', '_set_name', '_set_subtyp', '_set_values', '_set_with', '_set_with_engine', '_setup_axes', '_shallow_copy', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_try_aggregate_string_function', '_typ', '_unpickle_series_compat', '_update_inplace', '_validate_dtype', '_values', '_where', '_xs', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'as_blocks', 'as_matrix', 'asfreq', 'asobject', 'asof', 'astype', 'at', 'at_time', 'autocorr', 'axes', 'base', 'between', 'between_time', 'bfill', 'blocks', 'bool', 'clip', 'clip_lower', 'clip_upper', 'combine', 'combine_first', 'compound', 'compress', 'consolidate', 'convert_objects', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'data', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_array', 'from_csv', 'ftype', 'ftypes', 'ge', 'get', 'get_dtype_counts', 'get_ftype_counts', 'get_value', 'get_values', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'imag', 'index', 'interpolate', 'is_copy', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isnull', 'item', 'items', 'itemsize', 'iteritems', 'ix', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'nonzero', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'ptp', 'put', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'real', 'reindex', 'reindex_axis', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'reshape', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'select', 'sem', 'set_axis', 'set_value', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'sortlevel', 'squeeze', 'std', 'str', 'strides', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dense', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_msgpack', 'to_period', 'to_pickle', 'to_sparse', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'tolist', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'valid', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [37]:
print(help(st_name.plot))

Help on SeriesPlotMethods in module pandas.plotting._core object:

class SeriesPlotMethods(BasePlotMethods)
 |  Series plotting accessor and method
 |
 |  Examples
 |  --------
 |  >>> s.plot.line()
 |  >>> s.plot.bar()
 |  >>> s.plot.hist()
 |
 |  Plotting methods can also be accessed by calling the accessor as a method
 |  with the ``kind`` argument:
 |  ``s.plot(kind='line')`` is equivalent to ``s.plot.line()``
 |
 |  Method resolution order:
 |      SeriesPlotMethods
 |      BasePlotMethods
 |      pandas.core.base.PandasObject
 |      pandas.core.base.StringMixin
 |      builtins.object
 |
 |  Methods defined here:
 |
 |  __call__(self, kind='line', ax=None, figsize=None, use_index=True, title=None, grid=None, legend=False, style=None, logx=False, logy=False, loglog=False, xticks=None, yticks=None, xlim=None, ylim=None, rot=None, fontsize=None, colormap=None, table=False, yerr=None, xerr=None, label=None, secondary_y=False, **kwds)
 |      Make plots of Series using matplotlib / pylab.
 |
 |      *New in version 0.17.0:* Each plot kind has a corresponding method on the
 |      ``Series.plot`` accessor:
 |      ``s.plot(kind='line')`` is equivalent to
 |      ``s.plot.line()``.
 |
 |      Parameters
 |      ----------
 |      data : Series
 |
 |      kind : str
 |          - 'line' : line plot (default)
 |          - 'bar' : vertical bar plot
 |          - 'barh' : horizontal bar plot
 |          - 'hist' : histogram
 |          - 'box' : boxplot
 |          - 'kde' : Kernel Density Estimation plot
 |          - 'density' : same as 'kde'
 |          - 'area' : area plot
 |          - 'pie' : pie plot
 |
 |      ax : matplotlib axes object
 |          If not passed, uses gca()
 |      figsize : a tuple (width, height) in inches
 |      use_index : boolean, default True
 |          Use index as ticks for x axis
 |      title : string or list
 |          Title to use for the plot. If a string is passed, print the string at
 |          the top of the figure. If a list is passed and `subplots` is True,
 |          print each item in the list above the corresponding subplot.
 |      grid : boolean, default None (matlab style default)
 |          Axis grid lines
 |      legend : False/True/'reverse'
 |          Place legend on axis subplots
 |      style : list or dict
 |          matplotlib line style per column
 |      logx : boolean, default False
 |          Use log scaling on x axis
 |      logy : boolean, default False
 |          Use log scaling on y axis
 |      loglog : boolean, default False
 |          Use log scaling on both x and y axes
 |      xticks : sequence
 |          Values to use for the xticks
 |      yticks : sequence
 |          Values to use for the yticks
 |      xlim : 2-tuple/list
 |      ylim : 2-tuple/list
 |      rot : int, default None
 |          Rotation for ticks (xticks for vertical, yticks for horizontal plots)
 |      fontsize : int, default None
 |          Font size for xticks and yticks
 |      colormap : str or matplotlib colormap object, default None
 |          Colormap to select colors from. If string, load colormap with that name
 |          from matplotlib.
 |      colorbar : boolean, optional
 |          If True, plot colorbar (only relevant for 'scatter' and 'hexbin' plots)
 |      position : float
 |          Specify relative alignments for bar plot layout.
 |          From 0 (left/bottom-end) to 1 (right/top-end). Default is 0.5 (center)
 |      layout : tuple (optional)
 |          (rows, columns) for the layout of the plot
 |      table : boolean, Series or DataFrame, default False
 |          If True, draw a table using the data in the DataFrame and the data will
 |          be transposed to meet matplotlib's default layout.
 |          If a Series or DataFrame is passed, use passed data to draw a table.
 |      yerr : DataFrame, Series, array-like, dict and str
 |          See :ref:`Plotting with Error Bars <visualization.errorbars>` for
 |          detail.
 |      xerr : same types as yerr.
 |      label : label argument to provide to plot
 |      secondary_y : boolean or sequence of ints, default False
 |          If True then y-axis will be on the right
 |      mark_right : boolean, default True
 |          When using a secondary_y axis, automatically mark the column
 |          labels with "(right)" in the legend
 |      kwds : keywords
 |          Options to pass to matplotlib plotting method
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |      Notes
 |      -----
 |
 |      - See matplotlib documentation online for more on this subject
 |      - If `kind` = 'bar' or 'barh', you can specify relative alignments
 |        for bar plot layout by `position` keyword.
 |        From 0 (left/bottom-end) to 1 (right/top-end). Default is 0.5 (center)
 |
 |  area(self, **kwds)
 |      Area plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  bar(self, **kwds)
 |      Vertical bar plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  barh(self, **kwds)
 |      Horizontal bar plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  box(self, **kwds)
 |      Boxplot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  density = kde(self, **kwds)
 |
 |  hist(self, bins=10, **kwds)
 |      Histogram
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      bins: integer, default 10
 |          Number of histogram bins to be used
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  kde(self, **kwds)
 |      Kernel Density Estimate plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  line(self, **kwds)
 |      Line plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  pie(self, **kwds)
 |      Pie chart
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from BasePlotMethods:
 |
 |  __init__(self, data)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas.core.base.PandasObject:
 |
 |  __dir__(self)
 |      Provide method name lookup and completion
 |      Only provide 'public' methods
 |
 |  __sizeof__(self)
 |      Generates the total memory usage for a object that returns
 |      either a value or Series of values
 |
 |  __unicode__(self)
 |      Return a string representation for a particular object.
 |
 |      Invoked by unicode(obj) in py2 only. Yields a Unicode String in both
 |      py2/py3.
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas.core.base.StringMixin:
 |
 |  __bytes__(self)
 |      Return a string representation for a particular object.
 |
 |      Invoked by bytes(obj) in py3 only.
 |      Yields a bytestring in both py2/py3.
 |
 |  __repr__(self)
 |      Return a string representation for a particular object.
 |
 |      Yields Bytestring in Py2, Unicode String in py3.
 |
 |  __str__(self)
 |      Return a string representation for a particular Object
 |
 |      Invoked by str(df) in both py2/py3.
 |      Yields Bytestring in Py2, Unicode String in py3.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas.core.base.StringMixin:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)

None

In [40]:
st_name.to_excel('stu.xls')

In [41]:
import datetime

In [42]:
print(dir(datetime))

['MAXYEAR', 'MINYEAR', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'time', 'timedelta', 'timezone', 'tzinfo']

In [47]:
print(datetime.datetime(2018,7,17,3,45,56))

2018-07-17 03:45:56

In [49]:
print(datetime.date(2018,7,17))

2018-07-17

In [50]:
import time
time.ctime()

'Wed Jul 18 17:04:01 2018'

In [53]:
np.random.randn(4,8)

array([[ -1.41121380e+00,  -1.08855903e+00,   1.75254951e-03,
         -3.74632824e-01,   8.53410586e-01,   2.80877567e-01,
         -8.82625816e-01,  -4.77622945e-01],
       [ -4.31208879e-01,  -7.34310872e-01,  -1.15672801e+00,
          1.40977507e+00,  -9.43211425e-02,   1.46087954e-01,
         -8.46688110e-01,  -1.96663291e+00],
       [ -5.55125256e-01,   1.85478494e-01,   3.94061993e-01,
          5.23049374e-01,  -1.03802946e+00,   3.44180068e-02,
          8.22725926e-02,   5.17943541e-01],
       [  2.84533849e-01,  -3.75417819e-02,   1.89209318e+00,
          4.88251229e-02,   1.75482844e+00,  -1.29541187e+00,
         -4.77158642e-01,  -9.08950241e-01]])

In [117]:
st_names=['ram','shyam','kirit','hari','ghanshyam','rohan']

In [ ]:
index = ['NAme','MAth','Science']

In [118]:
math=[60,80,78,98,67,67]

In [119]:
science=[56,67,78,90,98]

In [120]:
data = [st_names,math,science]

In [121]:
data

[['ram', 'shyam', 'kirit', 'hari', 'ghanshyam', 'rohan'],
 [60, 80, 78, 98, 67, 67],
 [56, 67, 78, 90, 98]]

In [122]:
df= pd.DataFrame(data,index=index,columns=np.arange(6))

In [123]:
df

           0      1      2     3          4      5
NAme     ram  shyam  kirit  hari  ghanshyam  rohan
MAth      60     80     78    98         67     67
Science   56     67     78    90         98   None

In [124]:
d=df.T

In [125]:
d.describe()

         NAme  MAth  Science
count       6     6        5
unique      6     5        5
top     shyam    67       98
freq        1     2        1

In [155]:
df1= pd.DataFrame(np.random.randn(8,4),index=dates,columns=[1,2,3,4])

In [156]:
df1

                   1         2         3         4
2018-09-18  0.657928 -1.469224  0.799405  0.928253
2018-09-19  1.449846  0.043568 -1.160239  0.277678
2018-09-20  0.512994 -0.545984 -0.848406  1.458424
2018-09-21 -0.343553  1.130375  0.007526  0.340346
2018-09-22 -0.837730  0.533230  1.275620  1.396735
2018-09-23 -0.108027  0.416431 -0.545297  0.188622
2018-09-24  0.418306 -0.322445 -1.291923  0.244096
2018-09-25 -0.230813  2.116555 -1.309408 -0.821966

In [80]:
df2= pd.DataFrame(np.random.randn(8,4),index=dates)

In [81]:
df2

                   0         1         2         3
2018-09-30  1.171509  0.239687 -1.307582 -0.491223
2018-10-31 -0.315887  1.155600  0.702767 -0.727490
2018-11-30 -0.920590 -0.254614  0.928946 -0.066981
2018-12-31 -0.233959 -2.022706 -0.741903 -1.467727
2019-01-31 -0.266502 -0.004734 -1.334727 -0.214426
2019-02-28  0.674860  1.310126  0.965487 -0.287226
2019-03-31 -0.243815  0.869223 -0.739903  0.117212
2019-04-30 -1.492726 -0.577946  0.343122 -0.211184

In [84]:
df3 = pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20180715'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test",'train']),
    'F':'foo' ,
})
df3

   A          B    C  D      E    F
0  1 2018-07-15  1.0  3   test  foo
1  1 2018-07-15  1.0  3  train  foo
2  1 2018-07-15  1.0  3   test  foo
3  1 2018-07-15  1.0  3  train  foo

In [94]:
d={
    'username':['john','natasha','krish','root','harry'],
    'date':pd.date_range('20180918',periods=5,freq='D'),
    'password':['abc','dfgh','sdfgh','sdfgthy','sdefrgt']
}
df4=pd.DataFrame(d,index=range(1,6))
df4

        date password username
1 2018-09-18      abc     john
2 2018-09-19     dfgh  natasha
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root
5 2018-09-22  sdefrgt    harry

In [1]:
df4.dtypes

NameError: name 'df4' is not defined

In [99]:
df4.head(3)

        date password username
1 2018-09-18      abc     john
2 2018-09-19     dfgh  natasha
3 2018-09-20    sdfgh    krish

In [102]:
df4.tail(3)

        date password username
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root
5 2018-09-22  sdefrgt    harry

In [105]:
df4.index

RangeIndex(start=1, stop=6, step=1)

In [106]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [108]:
df4.describe()

                       date password username
count                     5        5        5
unique                    5        5        5
top     2018-09-20 00:00:00      abc     john
freq                      1        1        1
first   2018-09-18 00:00:00      NaN      NaN
last    2018-09-22 00:00:00      NaN      NaN

In [110]:
df2.describe()

              0         1         2         3
count  8.000000  8.000000  8.000000  8.000000
mean  -0.203389  0.089329 -0.147974 -0.418631
std    0.833036  1.088328  0.987109  0.494838
min   -1.492726 -2.022706 -1.334727 -1.467727
25%   -0.467063 -0.335447 -0.883323 -0.550290
50%   -0.255158  0.117476 -0.198391 -0.250826
75%   -0.006754  0.940817  0.759311 -0.175134
max    1.171509  1.310126  0.965487  0.117212

In [132]:
df4.sort_index(axis=1,ascending=False)

  username password       date
1     john      abc 2018-09-18
2  natasha     dfgh 2018-09-19
3    krish    sdfgh 2018-09-20
4     root  sdfgthy 2018-09-21
5    harry  sdefrgt 2018-09-22

In [133]:
df2

                   0         1         2         3
2018-09-30  1.171509  0.239687 -1.307582 -0.491223
2018-10-31 -0.315887  1.155600  0.702767 -0.727490
2018-11-30 -0.920590 -0.254614  0.928946 -0.066981
2018-12-31 -0.233959 -2.022706 -0.741903 -1.467727
2019-01-31 -0.266502 -0.004734 -1.334727 -0.214426
2019-02-28  0.674860  1.310126  0.965487 -0.287226
2019-03-31 -0.243815  0.869223 -0.739903  0.117212
2019-04-30 -1.492726 -0.577946  0.343122 -0.211184

In [135]:
df2.sort_index(axis=0,ascending=False)

                   0         1         2         3
2019-04-30 -1.492726 -0.577946  0.343122 -0.211184
2019-03-31 -0.243815  0.869223 -0.739903  0.117212
2019-02-28  0.674860  1.310126  0.965487 -0.287226
2019-01-31 -0.266502 -0.004734 -1.334727 -0.214426
2018-12-31 -0.233959 -2.022706 -0.741903 -1.467727
2018-11-30 -0.920590 -0.254614  0.928946 -0.066981
2018-10-31 -0.315887  1.155600  0.702767 -0.727490
2018-09-30  1.171509  0.239687 -1.307582 -0.491223

In [138]:
df2.sort_values(by=2,ascending=False)

                   0         1         2         3
2019-02-28  0.674860  1.310126  0.965487 -0.287226
2018-11-30 -0.920590 -0.254614  0.928946 -0.066981
2018-10-31 -0.315887  1.155600  0.702767 -0.727490
2019-04-30 -1.492726 -0.577946  0.343122 -0.211184
2019-03-31 -0.243815  0.869223 -0.739903  0.117212
2018-12-31 -0.233959 -2.022706 -0.741903 -1.467727
2018-09-30  1.171509  0.239687 -1.307582 -0.491223
2019-01-31 -0.266502 -0.004734 -1.334727 -0.214426

In [140]:
df2[3]

2018-09-30   -0.491223
2018-10-31   -0.727490
2018-11-30   -0.066981
2018-12-31   -1.467727
2019-01-31   -0.214426
2019-02-28   -0.287226
2019-03-31    0.117212
2019-04-30   -0.211184
Freq: M, Name: 3, dtype: float64

In [141]:
d

        NAme MAth Science
0        ram   60      56
1      shyam   80      67
2      kirit   78      78
3       hari   98      90
4  ghanshyam   67      98
5      rohan   67    None

In [147]:
k

0       1
1       2
2       3
3     NaN
4    helo
dtype: object

In [148]:
k=df.T
k.sort_values(by="MAth",ascending=True)

        NAme MAth Science
0        ram   60      56
4  ghanshyam   67      98
5      rohan   67    None
2      kirit   78      78
1      shyam   80      67
3       hari   98      90

In [159]:
k=df.T
k

        NAme MAth Science
0        ram   60      56
1      shyam   80      67
2      kirit   78      78
3       hari   98      90
4  ghanshyam   67      98
5      rohan   67    None

In [163]:
k.loc[1,"NAme"]

'shyam'

In [164]:
k.at[1,"NAme"]

'shyam'

In [173]:
k[k["MAth"] > 75]

    NAme MAth Science
1  shyam   80      67
2  kirit   78      78
3   hari   98      90